# -*- coding:utf-8 -*-

"""
# 1. 递归和非递归 （先序、中序、后序遍历二叉树）
# 2. bfs和dfs （广度优先遍历二叉树/图）
# 3. 回溯法思想 （走迷宫、八皇后）
# 4. 双向链表和循环链表 （LRU）
# 5. 深入动态规划和贪心算法
# 6. 分治法 （归并排序）
# 7. 分枝限界法
# 8. 10种排序算法的实现
# 9. AC自动机和DFA的实现

把以下经典的算法调试成功并吃透，在数据结构、算法、离散数学三门课程上，基本上能达到本科毕业生的上等水平：
0、二叉树的先序、中序、后序、层序(这四个程序一定一定要调试10遍以上，这四个搞不定的话，看算法导论几乎就是在读天书了；而且，它们是某些蛮力、回溯、分支界限等等算法的基础)
1、数组元素的：全排列A(M,M)、部分排列A(M,N)
2、数组元素的：幂集、组合C(M,N)
3、迪杰斯特拉算法、弗洛伊德算法求解最短路径
4、Prim、Kruscal求解最小生成树
5、HFM编码的加密与解密
6、归并排序、快速排序、堆排序、基数排序
7、八皇后、骑士巡游、八数码
8、0/1背包
9、TSP问题、哈密顿回路、欧拉回路
10、迷宫问题、染色定理
11、强连通分量
12、拓扑排序、关键路径
13、AVL树、红黑树
14、链表法解决哈希冲突
15、表达式二叉树

############################

# 1. leetcode sql x
# 2. leetcode shell
# 3. leetcode 100 x
# 4. leetcode 200 x
# 5. leetcode 300 x
# 6. leetcode 400
# 7. leetcode 500
# 8. leetcode 600
# 9. leetcode 700
# 10. leetcode 800
"""